CSI API ETABS v1
cGroup.SetGroup Method
 Sets the group data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGroup(
	string Name,
	int Color = -1,
	bool SpecifiedForSelection = true,
	bool SpecifiedForSectionCutDefinition = true,
	bool SpecifiedForSteelDesign = true,
	bool SpecifiedForConcreteDesign = true,
	bool SpecifiedForAluminumDesign = true,
	bool SpecifiedForColdFormedDesign = true,
	bool SpecifiedForStaticNLActiveStage = true,
	bool SpecifiedForBridgeResponseOutput = true,
	bool SpecifiedForAutoSeismicOutput = false,
	bool SpecifiedForAutoWindOutput = false,
	bool SpecifiedForMassAndWeight = true
)
Function SetGroup (
	Name As String,
	Optional Color As Integer = -1,
	Optional SpecifiedForSelection As Boolean = true,
	Optional SpecifiedForSectionCutDefinition As Boolean = true,
	Optional SpecifiedForSteelDesign As Boolean = true,
	Optional SpecifiedForConcreteDesign As Boolean = true,
	Optional SpecifiedForAluminumDesign As Boolean = true,
	Optional SpecifiedForColdFormedDesign As Boolean = true,
	Optional SpecifiedForStaticNLActiveStage As Boolean = true,
	Optional SpecifiedForBridgeResponseOutput As Boolean = true,
	Optional SpecifiedForAutoSeismicOutput As Boolean = false,
	Optional SpecifiedForAutoWindOutput As Boolean = false,
	Optional SpecifiedForMassAndWeight As Boolean = true
) As Integer
Dim instance As cGroup
Dim Name As String
Dim Color As Integer
Dim SpecifiedForSelection As Boolean
Dim SpecifiedForSectionCutDefinition As Boolean
Dim SpecifiedForSteelDesign As Boolean
Dim SpecifiedForConcreteDesign As Boolean
Dim SpecifiedForAluminumDesign As Boolean
Dim SpecifiedForColdFormedDesign As Boolean
Dim SpecifiedForStaticNLActiveStage As Boolean
Dim SpecifiedForBridgeResponseOutput As Boolean
Dim SpecifiedForAutoSeismicOutput As Boolean
Dim SpecifiedForAutoWindOutput As Boolean
Dim SpecifiedForMassAndWeight As Boolean
Dim returnValue As Integer
returnValue = instance.SetGroup(Name,
	Color, SpecifiedForSelection, SpecifiedForSectionCutDefinition,
	SpecifiedForSteelDesign, SpecifiedForConcreteDesign,
	SpecifiedForAluminumDesign, SpecifiedForColdFormedDesign,
	SpecifiedForStaticNLActiveStage,
	SpecifiedForBridgeResponseOutput,
	SpecifiedForAutoSeismicOutput,
	SpecifiedForAutoWindOutput, SpecifiedForMassAndWeight)
int SetGroup(
	String^ Name,
	int Color = -1,
	bool SpecifiedForSelection = true,
	bool SpecifiedForSectionCutDefinition = true,
	bool SpecifiedForSteelDesign = true,
	bool SpecifiedForConcreteDesign = true,
	bool SpecifiedForAluminumDesign = true,
	bool SpecifiedForColdFormedDesign = true,
	bool SpecifiedForStaticNLActiveStage = true,
	bool SpecifiedForBridgeResponseOutput = true,
	bool SpecifiedForAutoSeismicOutput = false,
	bool SpecifiedForAutoWindOutput = false,
	bool SpecifiedForMassAndWeight = true
)
abstract SetGroup :
        Name : string *
        ?Color : int *
        ?SpecifiedForSelection : bool *
        ?SpecifiedForSectionCutDefinition : bool *
        ?SpecifiedForSteelDesign : bool *
        ?SpecifiedForConcreteDesign : bool *
        ?SpecifiedForAluminumDesign : bool *
        ?SpecifiedForColdFormedDesign : bool *
        ?SpecifiedForStaticNLActiveStage : bool *
        ?SpecifiedForBridgeResponseOutput : bool *
        ?SpecifiedForAutoSeismicOutput : bool *
        ?SpecifiedForAutoWindOutput : bool *
        ?SpecifiedForMassAndWeight : bool
(* Defaults:
        let _Color = defaultArg Color -1
        let _SpecifiedForSelection = defaultArg SpecifiedForSelection true
        let _SpecifiedForSectionCutDefinition = defaultArg SpecifiedForSectionCutDefinition true
        let _SpecifiedForSteelDesign = defaultArg SpecifiedForSteelDesign true
        let _SpecifiedForConcreteDesign = defaultArg SpecifiedForConcreteDesign true
        let _SpecifiedForAluminumDesign = defaultArg SpecifiedForAluminumDesign true
        let _SpecifiedForColdFormedDesign = defaultArg SpecifiedForColdFormedDesign true
        let _SpecifiedForStaticNLActiveStage = defaultArg SpecifiedForStaticNLActiveStage true
        let _SpecifiedForBridgeResponseOutput = defaultArg SpecifiedForBridgeResponseOutput true
        let _SpecifiedForAutoSeismicOutput = defaultArg SpecifiedForAutoSeismicOutput false
        let _SpecifiedForAutoWindOutput = defaultArg SpecifiedForAutoWindOutput false
        let _SpecifiedForMassAndWeight = defaultArg SpecifiedForMassAndWeight true
*)
-> int
Parameters
Name
Type: System.String
This is the name of a group. If this is the name of an existing group, that group is modified, otherwise a new group is added.
Color (Optional)
Type: System.Int32
SpecifiedForSelection (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for selection; otherwise it is False.
SpecifiedForSectionCutDefinition (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining section cuts; otherwise it is False.
SpecifiedForSteelDesign (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining steel frame design groups; otherwise it is False.
SpecifiedForConcreteDesign (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining concrete frame design groups; otherwise it is False.
SpecifiedForAluminumDesign (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining aluminum frame design groups; otherwise it is False.
SpecifiedForColdFormedDesign (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining cold formed frame design groups; otherwise it is False.
SpecifiedForStaticNLActiveStage (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for defining stages for nonlinear static analysis; otherwise it is False.
SpecifiedForBridgeResponseOutput (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for reporting bridge response output; otherwise it is False.
SpecifiedForAutoSeismicOutput (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto seismic loads; otherwise it is False.
SpecifiedForAutoWindOutput (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto wind loads; otherwise it is False.
SpecifiedForMassAndWeight (Optional)
Type: System.Boolean
This item is True if the group is specified to be used for reporting group masses and weight; otherwise it is False.
Return Value
Type: Int32
Returns zero if the group data is successfully set; otherwise it returns a nonzero value.
Remarks
Items SpecifiedForAluminumDesign, SpecifiedForColdFormedDesignSpecifiedForBridgeResponseOutput are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'define new group
       ret = SapModel.GroupDef.SetGroup("Group1")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cGroup Interface
ETABSv1 Namespace